mdmfile/src/Catalogs/мдмРеквизиты/мдмРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмРеквизиты</name>
  <owners>Catalog.мдмСхемыДанных</owners>
  <owners>Catalog.мдмТабличныеЧасти</owners>
  <owners>Catalog.мдмФормыДанных</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеЗаполнения</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмФормыДанных/мдмФормыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмФормыДанных</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>СхемаДанных</name>
    <type>
      <types>CatalogRef.мдмСхемыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.мдмФормыДанных</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураФормы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>160</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойства</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКартинки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловноеОформление</name>
    <attributes>
      <name>ИмяЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>CatalogRef.мдмОтборы</types>
      </type>
    </attributes>
    <attributes>
      <name>Оформление</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловнаяОбязательность</name>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>160</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>CatalogRef.мдмОтборы</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмРеквизиты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьПредставление(НаименованиеВладельца = "") Экспорт
	
	//Если ТипЗнч(Владелец) = Тип("СправочникСсылка.СхемыДанных") тогда
	//	
	//	Если НаименованиеВладельца = "" тогда
	//		НаименованиеВладельца = Владелец.Наименование;	
	//	КонецЕсли;	
	//	
	//	ПредставлениеСсылки = НаименованиеВладельца + "." + Имя;
	//	
	//ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.ТабличныеЧасти") тогда	
	//	
	//	Если НаименованиеВладельца = "" тогда
	//		НаименованиеВладельца = Владелец.Имя;	
	//	КонецЕсли;	
	//	
	//	ПредставлениеСсылки = Владелец.Владелец.Наименование + "." + НаименованиеВладельца + "." + Имя;
	//	
	//ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.ФормыОбъектовБизнесПроцессов") тогда		
	//	
	//	Если НаименованиеВладельца = "" тогда
	//		НаименованиеВладельца = Владелец.Наименование;	
	//	КонецЕсли;	
	//	
	//	ПредставлениеСсылки = НаименованиеВладельца + "." + Имя;
	//	
	//КонецЕсли;	
	
	ПредставлениеСсылки = Имя;
	
КонецПроцедуры	

Функция КлючОбъекта() Экспорт
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.мдмФормыДанных") тогда

		Владельцы = Новый Массив;
		Владельцы.Добавить(Владелец);
		Владельцы.Добавить(Владелец.СхемаДанных);
		
		Ключ = Новый Структура;
		Ключ.Вставить("Имя", Имя);
		Ключ.Вставить("Владелец", Владельцы);
		
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.мдмСхемыДанных") тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФормыДанныхБизнесПроцесса.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.мдмФормыДанных КАК ФормыДанныхБизнесПроцесса
			|ГДЕ
			|	ФормыДанныхБизнесПроцесса.СхемаДанных = &СхемаДанных";
		
		Запрос.УстановитьПараметр("СхемаДанных", Владелец);
		
		Владельцы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Владельцы.Добавить(Владелец);
		
		Ключ = Новый Структура;
		Ключ.Вставить("Имя", Имя);
		Ключ.Вставить("Владелец", Владельцы);
		
	Иначе 
		
		Ключ = "Имя,Владелец";
		
	КонецЕсли;	
	
	
	Возврат Ключ;
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	СформироватьПредставление();
	
	ТипПредставление = мдмМетаданные.ПредставлениеТипа(Тип.Получить());
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
